constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3800;
        startFace       3672;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       7472;
    }
    outlet
    {
        type            patch;
        nFaces          18;
        startFace       7482;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          228;
        startFace       7500;
    }
)

// ************************************************************************* //
